# -*- coding: utf-8 -*-
"""task_03_02.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1gxJRW6bD3GfNlk756VXE2PyIXaMMMq9T

Составьте программу, которая запрашивает у пользователя 2 целых числа и выполняет операции:

арифметические: +, -, * , / , // , %, **;

сравнение: <, <=, >, >=, !=, ==,

выводя на экран результат каждого действия. В случае получение вещественного результата, округлите его до 2-х знаков после запятой (используя функцию round()).
"""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_01.
#
# Выполнил: Капранова В.Е.
# Группа: АДЭУ-211
# E-mail: !!!


a = 6
b = 1

print(a + b)
print(a - b)
print(a * b)
print(round(a / b, 2))
print(a // b)
print(a % b)
print(a ** b)

print(a < b)
print(a <= b)
print(a > b)
print(a >= b)
print(a != b)
print(a == b)

"""Вычислите значение следующего выражения (аргументы - целые числа и вводятся с клавиатуры):

![image.png](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAANwAAACGCAYAAAC2T+QQAAAThUlEQVR4Ae2dr6/CwLLH75+2yX2rKm4qbipeUFWoJi+IG1QVCoXCo1AoVM0jeUlVDQqFqkJVoZp8X3bb7S/gUNrtUmDECeccKN3Ozmdmd3Z35h9pmoJ+SAakA2Z04B8kaDOCJjmTnIUOEHDk4WmEY1AHCDiDwiYvR16OgCPgyMMZ1AECzqCwycORhyPgCDjycAZ1gIAzKGzycOThCDgCjjycQR0g4AwKmzwceTgCjoAjD2dQBwg4g8ImD0cejoAj4MjDGdQBAs6gsMnDkYcj4Ag48nAGdYCAMyhs8nDk4Qg4Ao48nEEdIOAMCps8HHk4Au5dwF0TXN91b7rv27w6AfcW5TtiZVlYHcni/5rXJ+DeAdxlhyn7H/znvxgYe/Xn3/jvl6959R7Z5//1z27Xvf5Mr97HxS7+TGNFwL0DuGgJ7mxwfse96Z5vG04Kb07AvUEB460Ltgjf2vG/NpQby/MScG8ALlwwuNuYgHuD7N8NHgFnvNPP2Dgcy+gz5yDvVthPvz8BZxq4JMCMTbG7DA/c9Xp7j3v/+3Ql/qT2E3CmgTuuYFkrHAe/b4QlY+C2B3+5xHIxg2tz2MsIyeD3vgX9k6AYsq0EnGHlu+ymYLPAgNJnwGUheg5rMsM6jMex2B5v4TILi8Pl5+axBJxh4KIlg7M5G1A0AZyL7RjXq6Jlq/XHb5znEnBGgYuxdRn8w/Wzgbv2a38svPyzxXvbxLDb/NCXgDMJ3PUA35jXER7OwmQ6xcxfwnctOPMdTklfJRPf2y/KGi052HyPOEmQNH7i/RwWn37sTpJn8z8CziRw5w0ctkRk5J4nbNwZdmcF2BmbCQPrHbDJ5obdh3sJghnDLEhuvXwSYmFxTHffu0ZJwBlR/kzpk2AGNt3hYvCeVYsr5o9iKDe/p+yt29QfuHMY4nSzLHJBMOPg/sFAQEkZIfOvBFxrRevfOceVBb6Mbi17mzYkZwQrD47jwLZtuL4YHl4Qrqbyb9uewA9Kz3AJ5uCMYxaUkUAFXD8P0he4+3IU8zpuLRD2HvLe//6q4Xnn7wRcG2XX8pkLdtMHQ6ln359EWNoc3i6Pbp63mIg1Ni7W1UJczgHmDgdjMwS5wgq4GeOYF8BdcfCFh5tgUwwzuyjnAMBdAsw4w2RrInrb5Zn1XUPAPVN2be8LRXU6KftxZcNahOVQS+5WEfBkwYXjSsDWmJ+dN5i46zJIEu8w5UwC2m/hWz9wmXHwsL8ZZupT9Hd6teq9CThtQD1RDrnY6+NwZ7tVtUNufxdDySWCqlcSx3sEYOqIT3JGFEY4N4ZjSbSGZ9uw5TB0gtkm0jB/1AzcZQ+v+iym+uNN9yHgDAn+evDB3C1iDffLPAKDtTp2mw8+a4OC4Nla2YP3vX05b7w1IHXDdNl7mXf+keNKBNwz5dP0/nnjaDoDF8u5oBhCmllArwOSpjo9XLZEIJ6lczBJU/88Mwy63ifgjHRYpljTXXvLX+vg+IgwOmdzuGL+VgZIxGcv4QbLwETQQSdwIRa5l+wXOW0ahfH+TcAZAU4kDeq4OyOPSCqPJtfyhJLWhqdiUVtEJO8sJmt/Po3AiUAOATde61Cz+toVacDnlkmD6h6p9bPkARLurnGMs+UBzkXAZI2TlEGMwLfBvb2W+eHzdmkErrKJmTzcJyn02NsqFKvzlioB1ASc27AtB/PdCZfzHv6Eg1tiEXyC2TrUEH1sa3A0Ald4b1Peue0zDvc5GlIagFUmDfIP4ziL1vt5NQKXpkjOEcJjuUPmuYcdDgYT9ybgeiugUoAYh6UPf7PB0rUx8YN8iJft8PiepEERlrzjfFSbrJXMP++VgNOlBHKuxTE/JEjzuUm2HiWSBjEsws9TjocWv+d5uIffq6svRvw9BJy2zrnglO/2kIu53MFapDJXSYPGePJa27N/kTEZWCYEnE4BX2NEwRZzuXM/XxMTSYO4qTNwpPhj954EnE7g8u+SR024i83pCnNJgwi2scMm2kfA6QLuckIYnrLwvFrQnQf4v+WAex51tZ2+Z5g9qXfkSsDdEUoXSyk3FPMJNqcUqUylwOGs/9dg0iDycF36zfQ1BJwm4NLkiLXnwPOXmLs2posD4lTsFex2Bs60ItD9zBgsAk4XcPe+R3q6BcJ779H/jA3jxmRMCLgOin8K222lUkmD2pyBkye2H5wvo/fKgo1jgqdLWwi4V4GT+TfaeS0xr/uVc15dlO8XryHgXgRO5BdhreZlWdKgzmfgXmzXLyrvJz4zAfeKYldSDzw/bS02+VpYid0mr9yDPvvV8iLgXlBwlUtEzKmeFuTonDSIAP1mA0XAtQVOejcLlpVP4J8ct5FJg1RWrbb3oM99tXcThoSAa6nkwrtZqwiiPreMGj6BqX/SoCuSpF+VGu2e4pp8yZm+940iCLhWwIlMWTOZqFQeJpXh+79SJmRJg3qdgZNHfMa06TnLFvYrqRC0G6tczwi4VsBVLGKRh+OvgEiPpEGqPQTcVw4vCTil4G1f1cZk9kedAJk0aIpdn9TdBoGLwzVmEyvL5sw4bG+F8Kbt5OF0eD0Cri1oxeeynB5iHvcw87GApXPSoNybGgEuRjB3wLmDRXDO5mfJCespA7NVVjDl3Qk4Aq6AQCmFiddM8WTgZBaUBTYqbZHzvAfvte60wYFLEC3FIn69pFVRGEQUCql5OQKudd9VdKF5DXm4P4TTFJb6W9VZu+/FsqRBT9fpnt13aOCOK9gi+NP0xPEBq9kM/u7YMCYEnOr/Pq8E3DPFv/N+WRS+6QWEh9WUNGhg4GSdbQFc6wKRBFwf0NS1BNwdoJRwHr6qclH3isvLpEEutn2TBg0KnIiiZuuJ022IYDGVlVUdi8NyPKzCezUQhgMuOe3gT+yswKS3xrFRdis+LOB5Cxz6yrRLX2u+hoDrIlAZhcwVtlmgQ8CoI2nQkMAVBUHEM3BMi8qjCcJ8Xne73jYQcLJQ5BTbcwo1cqgHo0QeTNHOrPjkQyPYpR/fcA0B10noSgluyyzJpEHTXf/U40MCV1naKGsU5AEnZUz4DIGBoEm2g0fUuRNz36ySa62+nMh6dm+u2anfTATV/r4HAdep47KjNzJS2YBLBFTqFvrvDnhosQ0Bd3ter1z2qHu5VzxcvtzAONzN8Y/tYJXqroXXre/gkVvkvqh+HAHXCbgURdChNnyMZdKgmY6yUQ+AKyqGyu1l2bBWgv/kb74IK4r/V122Erh6QOUF4JSXFG2qyeex8VHPxWubwrN7iufTItOOff3QKHb4PgKug9BEB8iho1TySqTyeoDf6nDqY8UrOvcBcMX7HdudXZ8ZBqHIdS8m2qUBuDTBaefDfRiAaT5/WQm1ds6w8HrfMX8TsifguiqumltUI5U6kwYNClwKdbZvmCFlE6gnf0tDJbx1fTiZhotWJzP0GKEnbeyqJ43rCLiGQFp3XmF9hZfIwugyaVCtMmmPThwYuFTVZptsca7KQBoNMRT0caiF518YUla/r83vRRCnfjrisVHoIdc27RnwMwRcZ+GWa1nKS4h5nfq9NbiP7j80cGkWhudiWWBzynaVXI7YTDkYd7CMmuWLBwQuPWJlCw83weacwXTez7OdMIyhNsx8JK8P+T8B17mjynkHk5FKzUmDDAAnjEIcruA5jZMCdxeYhwQuRXoJsfIcWNyC7Thw3Um2HNAcZnbur3F4RQKuRweqIQ9jYigkIn9/nZF7scMNAdfeEw8J3BXXa10+KmrJvH3/Nc0efdxePvX2P7qOgOvRGXLOpiKV4RauTmv8K8DFe3hyJ8lE7jbJFPWM7UQMMTl8UeCyRx+N7VoCrk9nqgCDmGf4PtiTPCcvdf6PAFcur5TAJQdfHobl011etrmd93hJvn36vce1BFwP4aVFODtfgF6E+qzxjwAns5sxC/Mgj/RGK7icgTtLRLUo6XdAR8D1AS4/iqN2evRKGtRsx48Al6YJorUHx7bhODZsx8NiF32dZ1Pel4BrKvpLf2eHTTPgOJaRRisc7zGb7UekeFdEKw+raGSp+17qL4390/G+AwOXbfGZWBYs24a3ald1RlmDT3hVm2vl8ZHa7vr3d+4nyO/X2jgocOfNJIs0bTaYykiUZi/Q0cpo7WS1/aiZqmAMbaM26JtTa5LlcMCJgIKEbIbNdp6lYLOXiBrrLVqVX5NQXmqTrCHAwGq73Mm7vSTDd/Tbm+45HHAqDUEeKr8m35omOzvqojVg8iZlIEiGN5SDAVfMbXSGykepiDH2MxcbKks1uuHbGA3IQMCV+wzVTvoxPjy1aXiLTjKuy1grcNdwkafLzheCa6eQfRy+bf42So9b72BS+HHJQytwRecWR+wbBwpJQWnY9eM6MAxwXUPllZK+avdG+1eORUiLsoXR+3HFHqscBgGuqKE24lB5e5DvDY/pf58iv7GBNwhwqkpo7/z6ZKVpCPplOjAAcFlufWEBF+G4Jqxjs3bUnt/TD/3AFUdWOuTXpzkcebQv82hNo6ofOJU+rmUC0GaD6O/fs/q/1OfagSvSDvQtSPjllu6XlIyetTSi2oFTKcApYFIKmRSOZKF0QDNwqsjFJx3DyTYfi5JNV/KqhuaQWQYwxi04tqiY8z2pzBVYj161AJecI4THGKlMFZdn7f2UbVxF1t+/19Zuc/CT1X6kVG3/fz2u4aisZ3dzYX6fjPsDp2pFixz766yWl5ZyTaa8jcwd8jds7KZW2vcpQltI9H5OVfEhD9d6aKHSnIksS2tRPfPDlFO231kjShIkjZ/LcY0Js++k/Sbg9ICnKvUQcK2BS5Mj1p4Ny7JgT3zsTp+VuLOswNmEKMZ2ymAvoyzvvimP+1P3IeDag/YVinFFfAwRxbebno8rG2yyqVeW+YpnbhqWd/5NwP0YcPeV7RotYbMptqOayJ8RLDzYIkmq7WERnGVfJaKt9grHR0GqPCjELSeLCE53OJ8DLDwXrmuDi0iht8BejEwSUQLYw2Qygc05LJEjcp9X1rkxNglO+wU8kUvSduSPO1sjfCCz5LTHaubK7xXFOhx3hnW4g/9q0CQ5Yedn7RNyWB8bI6r4gIXnYXEQQbz7/fvO//cPmozwofoJNCudVC99++6OE2F0ET7nsB27OOTLbVFtRswxbz10UwbxzsuKG3IO7vg45Cn9knCRVanhAkgb/iHLgJwmIRaWCCZZt9+fnLKyVraPoAAswWkzBWc25kFd2cW9OWOw5/tyxHA9Yz+3sza1XhbI5CCWcFIVXW5kS1PrwGONKhNwDYORVW3RWAWn8f1NEFr9fdpi6q4QVlJ/S88mAjphw8I/ul8RjW0+mxrWMTSjy9Eyi97W/5/g4Av4Gbx9DmdxT7VxvazzVoAhCjw2vbCCpi1wYttgDphIkS4grlfXUTX7ms/4boNZ3p+AK5RFCEV12B3lqH2uFGArYDRfm4RiyFvxRm2+vwBugbD2+RK45ukOBRxbRuXwTFVOZfc3p6tr1AihKOl1b6vfi8CdgxWWcihd5syZBRWDo4qrjHgfLwFXVT618frVssFdTznwBcKm1a+2587vcTCHzV2smnOXO5+tGYMCuHpZ3zQtgWumalfwVIEr9so+8ErFNdITqZ1HDNXvKNr1InDFdUreDa8Z76bZEPUe3M/kY+h9Aq4i6MIay4qm7/VihXJV2nfeTsHteWXe9EIbNQGn1l0fbccqgJNeJt/CJYZ+VS+pnqkjcAX0tYwCpdcb6/xN9CkBpzo/jbF18x0n95Sj+NwLSq7tmjwg4a5wrMzj0vSK426J7U097jtt1ARcqoZtD4aU6rS/ykStghjsntfpBFxZQKU2nFTbCplT1Am/Z7Te/T8CroCiHFrdtcbF5+4o88DviaESt6bYHhMklSFoHPiwWVnI8E9l0gVcekEwexQ0UXPgSuRUbf1rDP9kW09d9lKWXrM2BFbTgRHP38QzE3AKlsLaPhj+qM8ZfpXRSO5gtlpj4WaKni0HCG/M0Xr4FPp5CN5vBE3CfC2MwW+kxAj93OM3s2cnEZYOB+NTbI4qUhkj8EWYn8PbNZcFxHKB2LUTlrt24gC+nX//vaWHP+QsNyUwhskmW4tMz3vM1XfVhpnmjeOfRo+Aq3RIUXyEwV6fyqjcHx3/TLi935dtqu7lPGPvT8AZhzURC8dK2SvP0WxvYUjEGl6++J3PqdR8SwAsiiHKMDtbIlLekIsiiY5cbBfLAHW4Y0S7BaZWZgTkGqFaQG+2IU0Rh2vM5EJ79p1ysT1Yw5UL3wq8ZkDn0XNdEK48OBaHJdruupjINUOG+jDz0fXv+z95uKpyxEeE0bm0wtX36PdxGKE0xfXaWOhXUUvmYT/yGn0EHIE0GpCejwhi7L3Mo07EbpO8785bUYeQQaz9JSPvTwJu5B2klIpeU6RFCn2GArgkr0PIP+OIDwFHwBWeYvRQ5ykYrXmAi+i3JMJKBJK48zFnFgk4Au5zgEtTJNE6O6Eggjm2A2+xQ1RsoH5fMKStsSLgCLiPAq6tYo/1cwQcAUfAGdQBAs6gsMdqdald5oaiBBwBRx7OoA4QcAaFTZ7EnCcZq6wJOAKOPJxBHSDgDAp7rFaX2mXO8xJwBBx5OIM6QMAZFDZ5EnOeZKyyJuAIOPJwBnWAgDMo7LFaXWqXOc9LwBFw5OEM6gABZ1DY5EnMeZKxypqAI+DIwxnUgf8HF8L2yCEFbnAAAAAASUVORK5CYII=)

Округлите результат до 3-х знаков после запятой, используя функцию round().
"""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_02.
#
# Выполнил: Капранова В.Е.
# Группа: !!!
# E-mail: !!!


x = 0
y = 1
z = 2
res1 = ((x**5 + 7) / (abs(-6) * y))**(1/3)
res2 = 7 - (z % y)
res = res1 / res2
print(round(res,2))



# --------------
# Пример вывода:
#
# x=0
# y=1
# z=2
# 0.15

"""Дана электрическая цепь, состоящая из 2-х последовательно соединенных проводников (сопротивление каждого известно). Найти общее сопротивление цепи (округление результата необходимо выполнить до 1-го знака после запятой)."""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_03.
#
# Выполнил: Капранова В.Е.
# Группа: !!!
# E-mail: !!!



r1 = 12.2

r2 = 16.1

# Общее сопротивление
r = r1 + r2

# Удалите комментарий и допишите код
print(r1)
print(r2)
print(float (r))

# --------------
# Пример вывода:
#
# r1=12.2
# r2=16.1
# 28.3

"""Дано двузначное и трехзначное число. Для каждого выведите на экран сумму и произведение цифр."""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_04.
#
# Выполнил: Капранова В.Е.
# Группа: АДЭУ - 211
# E-mail: !!!


num2 = 45

num3 = 456

# 1-я цифра числа 'num2'
num2_1 = num2 // 10
# 2-я цифра числа 'num2'
num2_2 = num2%10

# Сумма цифр числа 'num2'
num2_s = num2_1 + num2_2
# Произведение цифр числа 'num2'
num2_p = num2_1 * num2_2

# 1-я цифра числа 'num3'
num3_1 = num3//100
# 2-я цифра числа 'num3'
num3_2 = (num3%100)//10
# 3-я цифра числа 'num3'
num3_3 = num3%10

# Сумма цифр числа 'num3'
num3_s = num3_1 + num3_2 + num3_3
# Произведение цифр числа 'num3'
num3_p = num3_1 * num3_2 * num3_3

print ('Сумма и произведение цифр двузначного числа:', num2_s , num2_p)
print ('Сумма и произведение цифр трехзначного числа:', num3_s , num3_p)
# Вывод результата
# Удалите комментарий и допишите код


# --------------
# Пример вывода:
#
# Двузначное число: 45
# Трехзначное число: 456
# Сумма и произведение цифр двузначного числа: 9 20
# Сумма и произведение цифр трехзначного числа: 15 120

"""С начала суток прошло m минут (0<m≤24∗60). Определите:

целое количество часов, прошедших с начала суток;

количество минут, прошедших с момента начала последнего часа.
"""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_05.
#
# Выполнил: Капранова В.Е.
# Группа: !!!
# E-mail: !!!


# Количество минут
m = int(input('Количество минут, прошедшее с начала суток: '))
0<m<=24*60
# Количество часов, прошедших с начала суток
h = m//60
# Количество минут, прошедших с момента начала последнего часа
m2 = m - (h*60)

print("Количество часов, прошедших с начала суток:", h )
print("Количество минут, прошедших с момента начала последнего часа:", m2)


# --------------
# Пример вывода:
#
# Количество минут, прошедшее с начала суток: 123
# Количество часов, прошедших с начала суток: 2
# Количество минут, прошедших с момента начала последнего часа: 3

"""Дано уравнение ax + b = 0 и отрезок [m;n]. Ответьте на вопрос, попадает ли решение уравнения в указанный отрезок."""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_06.
#
# Выполнил: Капранова В.Е.
# Группа: !!!
# E-mail: !!!


a = int(input('Введите a = '))
b = int(input('Введите b = '))
m = int(input('Введите m = '))
n = int(input('Введите n = '))

x = -b/a

is_ok = -5<=x<=5

print("Попадает:", is_ok)


# --------------
# Пример вывода:
#
# Введите a = 1
# Введите b = 2
# Введите m = -5
# Введите n = 5
# Попадает: True

"""Составьте программу, которая запрашивает название футбольной команды и повторяет его на экране со словами

... - чемпион!
После этого выполните:

используя операцию дублирования, нарисуйте черту (набор "-"), длиной, равной размеру названия команды;

преобразуйте строку в нижний регистр и выведите на экран:

длину наименования команды;

есть ли в наименовании команды буква "п" (True/False)?

сколько раз повторяется буква "а"?
"""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_07.
#
# Выполнил: Фамилия И.О.
# Группа: !!!
# E-mail: !!!


team = input("Введите название команды: ")
   
print('{} - чемпион!'.format(team))

len(team)
print('-'*len(team))
team = team.lower()

print('Символов в названии команды:', len(team) )
print('Буква "п" есть:','п' in team)
print('Количсетво букв "а":',team.count("а"))


# --------------
# Пример вывода:
#
# Введите название команды: Спартак
# Спартак - чемпион!
# -------
# Символов в названии команды: 7
# Буква "п" есть: True
# Количество букв "а": 2

"""Составьте программу, которая запрашивает название государства и его столицы, а затем выводит сообщение:

Государство - ..., столица - ...
На месте многоточий должны быть выведены соответствующие значения.
"""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_08.
#
# Выполнил: Капранова В.Е.
# Группа: !!!
# E-mail: !!!


# Название государства
country = input("Введите название государства: ")
# Название столицы
capital = input("Введите название столицы: ")

print('Государство - {}, столица - {}' .format(country, capital))



# --------------
# Пример вывода:
#
# Введите название государства: Россия
# Введите название столицы: Москва
# Государство - Россия, столица - Москва

"""Дано слово объектно-ориентированный. Используя индексацию и срезы составьте из него слова объект, ориентир, тир, кот, рента и выведите их на экран."""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_09.
#
# Выполнил: Капранова В.Е.
# Группа: АДЭУ-211
# E-mail: !!!


word = "объектно-ориентированный"

w1 = word[:6] 
w2 = word[9:17] 
w3 = word[14:17]
w4 = word[4:-8:5]
w5 = word[10] + word[12:15] + word[19]

print(w1, w2, w3, w4, w5, sep="\n")


# --------------
# Пример вывода:
#
# объект
# ориентир
# тир
# кот
# рента

"""

Создайте 2 пустых списка и выполните операции, описанные в заготовке."""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_10.
#
# Выполнил: Капранова В.Е.
# Группа: АДЭУ-211
# E-mail: !!!


# Создать 2 пустых списка
a = []
b = []

# Добавить 2 вещественных числа (4.5 и 3.4) в список 'a' с помощью append
a.append(4.5)
a.append(3.4)

# Добавить 2 вещественных числа (8.7, 1.3) в список 'a' с помощью extend
m = [8.7, 1.3]
a.extend(m)

# Добавить 2 вещественных числа (14.5, 3.4) в список 'b' с помощью append
b.append(14.5)
b.append(3.4)

# Добавить 2 вещественных числа (8.7, 11.3) в список 'b'с помощью extend

l = [8.7, 11.3]
b.extend(l)

# Вставить целое число 100 на 2-е и 4-е место списка 'a'
a.insert(1, 100)
a.insert(3, 100)

# Вставить целое число 200 на 1-е и 3-е место списка 'b'
b.insert(0, 200)
b.insert(2, 200)
# Вывести списки на экран
print("Исходные списки:" )
print(a)
print(b)

# Удалить первые элементы из списков 'a' и 'b'
del a[0]
del b[0]

# Удалить элемент 100 из списка 'a'
a.remove(100)
# Удалить элемент 200 из списка 'b'
b.remove(200)

# Вывести списки на экран
print("\nПосле удалений:")
print(a)
print(b)


# Создать множества из списков 'a' и 'b', а также их пересечение
sa = set(a)
sb = set(b)
sa_and_sb = set(a) & set(b)

# Вывести экран уникальные элементы каждого списка и общие
print("\nУникальные элементы:")
print("a:", sa)
print("b:", sb)
print("общие:", sa_and_sb)

# Соединить списки 'a' и 'b'
c = a+b

# Отсортировать список 'c' по возрастанию и убыванию
c_asc = sorted(c)
c_desc = sorted(c, reverse=True)

# Среднее арифметическое элементов списка 'c', расположенных на четных местах
sr_ar = sum(c[1::2]) / len(c[1::2])
# Среднее геометрическое элементов списка 'c', расположенных на нечетных местах
h = c[::2]
g = h[0] * h[1] *h[2]*h[3]
# Среднее геометрическое элементов списка 'c', расположенных на нечетных местах
sr_geom = round(g**(1/len(h)), 2)
# Максимальный и минимальный элементы
c_max = max(c)
c_min = min(c)

# Вывести результаты на экран
print("\nИтоговые:")
print("3-й:", c)
print("Сортировка(возр.):", c_asc)
print("Сортировка(уб.):", c_desc)
print("Ср. арифм =", sr_ar, ',', "ср. геом =", sr_geom)

print("Макс. и мин.:", max(c), min(c))
# Удалите комментарий и допишите код


# --------------
# Пример вывода:
#
# Исходные списки:
# 1-й: [4.5, 100, 3.4, 100, 8.7, 1.3]
# 2-й: [200, 14.5, 200, 3.4, 8.7, 11.3]
#
# После удалений:
# 1-й: [3.4, 100, 8.7, 1.3]
# 2-й: [14.5, 3.4, 8.7, 11.3]
#
# Уникальные элементы:
# 1-й: {8.7, 1.3, 3.4, 100}
# 2-й: {8.7, 11.3, 3.4, 14.5}
# общие: {8.7, 3.4}
#
# Итоговые:
# 3-й: [3.4, 100, 8.7, 1.3, 14.5, 3.4, 8.7, 11.3]
# Сортировка (возр.): [1.3, 3.4, 3.4, 8.7, 8.7, 11.3, 14.5, 100]
# Сортировка (убыв.): [100, 14.5, 11.3, 8.7, 8.7, 3.4, 3.4, 1.3]
# Ср. арифм. = 29.00, ср. геометр. = 7.82
# Макс. и мин.: 100 1.3

"""Создайте пустой словарь для хранения информации о себе и выполните операции, описанные в заготовке."""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_11.
#
# Выполнил: Капранова В.Е.
# Группа: !!!
# E-mail: !!!


# В данной задаче все значения задаются в коде (без input())

# 1. Создание словаря
# Создать пустой словарь
info = {}

# Добавить значения для ключей "фио", "дата_рождения", "место_рождения"
info["фио"] = 'Иванов Иван Иванович'
info['место_рождения'] = 'Париж'
info["дата_рождения"] = '01/09/1995'


# Напечатать словарь
print(info)

# Создать ключ "хобби" со значением = список из строк -
# наименований хобби (например "плавание" и т.д.)
info["хобби"] = "плавание", "танцы"

# Добавить "программирование" в список хобби
info["хобби"] = "программирование"
# Создать ключ "животные" со значением = кортеж из строк -
# имен домашних животных (например "кошка Мурка" и т.д.)
info["животные"] = 'Кошка Мурка'

# Создать ключ "ЕГЭ" и поместить в него пустой словарь
info["ЕГЭ"] = {}

# В словарь info["ЕГЭ"] добавить информацию о сданных экзаменах,
# где ключ - наименование предмета, а значение - количество баллов
info['ЕГЭ'] = {'Математика' : 90, 'Русский язык' : 89 }

# Добавить экзамен, который не был сдан, после чего удалить его
info ['ЕГЭ'] = {'Физика' : 30}
del info['ЕГЭ']('Физика')
# Создать ключ "вузы" и поместить в него пустой словарь
info["вузы"] = {}

# В словарь info["вузы"] добавить информацию о вузах,
# где ключ - аббревиатура вуза, а значение -
# количество баллов для специальности, на которую хотели поступить
info["вузы"] = {'МИРЭА': 240, 'МГУ': 295, 'МГТУ им. Баумана': 255}

# 2. Вывод на экран
print("Данные:")
# Получившийся словарь
print(info)

# Список экзаменов ЕГЭ в алфавитном порядке
# (используйте метод ``keys()``, преобразовав результат в кортеж)
exams = # Удалите комментарий и допишите код
print("Предметы:", exams)
# Список вузов в алфавитном порядке
uni = # Удалите комментарий и допишите код
print("Вузы:", uni)

# 3. Ответы на вопросы
print("\nОтветы на вопросы:")

# Выделить имя из info["фио"]
name = # Удалите комментарий и допишите код
# Начинается на гласную? (True/False)
starts_with_vowel = # Удалите комментарий и допишите код
print("* мое имя начинается на гласную букву:", starts_with_vowel)

# Выделить месяц из info["дата_рождения"]
month = # Удалите комментарий и допишите код
# Родился зимой или летом? (True/False)
born_in_winter_or_summer = # Удалите комментарий и допишите код
print("* родился летом или зимой:", # Удалите комментарий и допишите код)

# Количество хобби и первое из них
hobbies_count = # Удалите комментарий и допишите код
print("* у меня {} хобби, первое \"{}\"".format(# Удалите комментарий и допишите код))

# Количество сданных экзаменов
print("* после окончания школы сдавал {} экз.".format(# Удалите комментарий и допишите код))

# Сумма баллов по экзаменам
sum_mark = # Удалите комментарий и допишите код
print("* сумма баллов = {}".format(# Удалите комментарий и допишите код))

# Максимальный балл среди сданных
max_mark = # Удалите комментарий и допишите код
print("* макс. балл = {}".format(# Удалите комментарий и допишите код))

# Количество вузов, в которые Вы проходите по баллам
# Подсказка: определить, проходите Вы или нет, можно простым сравнением
# суммы баллов с проходным баллом вуза - ``True/False``.
# Для того, чтобы определить количество таких вузов, преобразуйте
# сравнение в целое число (используя ``int()``) и сложите все сравниваемые вузы.
vuz_count = # Удалите комментарий и допишите код
print("* кол-во вузов в которые прохожу: {}".format(# Удалите комментарий и допишите код))



# --------------
# Пример вывода:
#
# {'фио': 'Иванов Иван Иванович', 'место_рождения': 'Париж',
#  'дата_рождения': '01/09/1995'}
# Данные:
# {'фио': 'Иванов Иван Иванович', 'животные': ('кошка Мурка',),
#  'вузы': {'МИРЭА': 240, 'МГУ': 295, 'МГТУ им. Баумана': 255},
#  'хобби': ['игра на гитаре', 'туризм', 'программирование'],
#  'ЕГЭ': {'Математика': 90, 'Информатика': 88, 'Русский язык': 67},
#  'дата_рождения': '01/09/1995', 'место_рождения': 'Париж'}
# Предметы: Информатика, Математика, Русский язык
# Вузы: МГТУ им. Баумана, МГУ, МИРЭА

# Ответы на вопросы:
# * мое имя начинается на гласную букву: True
# * родился летом или зимой: False
# * у меня 3 хобби, первое "игра на гитаре"
# * после окончания школы сдавал 3 экз.
# * сумма баллов = 245
# * макс. балл = 90
# * кол-во вузов в которые прохожу: 1